Revit 2027 API
BuiltInFailures.KeyBasedTreeFileFailures.CannotOpenFileForRead Property
 Cannot open file [FileName].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotOpenFileForRead { get; }
Public Shared ReadOnly Property CannotOpenFileForRead As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotOpenFileForRead {
	FailureDefinitionId^ get ();
}
static member CannotOpenFileForRead : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.KeyBasedTreeFileFailures Class
Autodesk.Revit.DB Namespace